WEL-Projects/WELPCR/STM32_PCR_firmware_for_WELPCR/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */




/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */










/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LCD_CS_Pin GPIO_PIN_14
#define LCD_CS_GPIO_Port GPIOC
#define BUZZER_Pin GPIO_PIN_4
#define BUZZER_GPIO_Port GPIOA
#define J_UP_Pin GPIO_PIN_0
#define J_UP_GPIO_Port GPIOB
#define J_DOWN_Pin GPIO_PIN_1
#define J_DOWN_GPIO_Port GPIOB
#define LCD_DC_Pin GPIO_PIN_2
#define LCD_DC_GPIO_Port GPIOB
#define J_LEFT_Pin GPIO_PIN_10
#define J_LEFT_GPIO_Port GPIOB
#define J_RIGHT_Pin GPIO_PIN_11
#define J_RIGHT_GPIO_Port GPIOB
#define J_MID_Pin GPIO_PIN_12
#define J_MID_GPIO_Port GPIOB
#define J_SET_Pin GPIO_PIN_13
#define J_SET_GPIO_Port GPIOB
#define J_RST_Pin GPIO_PIN_14
#define J_RST_GPIO_Port GPIOB
#define BLOCK_PWM_1_Pin GPIO_PIN_8
#define BLOCK_PWM_1_GPIO_Port GPIOA
#define BLOCK_PWM_2_Pin GPIO_PIN_9
#define BLOCK_PWM_2_GPIO_Port GPIOA
#define LID_PWM_Pin GPIO_PIN_10
#define LID_PWM_GPIO_Port GPIOA
#define TOUCH_CS_Pin GPIO_PIN_3
#define TOUCH_CS_GPIO_Port GPIOB
#define STATUS_LED_Pin GPIO_PIN_4
#define STATUS_LED_GPIO_Port GPIOB
#define LCD_RESET_Pin GPIO_PIN_5
#define LCD_RESET_GPIO_Port GPIOB
#define TOUCH_IRQ_Pin GPIO_PIN_8
#define TOUCH_IRQ_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
